{
    "title": "SVG Compressor",
    "description": "Compress SVG files online for free, can compress about 50% of the volume, support custom parameters, visual compression, support one-click copy/download/delete results",
    "upload": "Upload SVG",
    "drag": "Drag and drop SVG files here or click to upload",
    "optimize": "Optimize",
    "download": "Download",
    "preview": "Preview",
    "operation": "Operation",
    "copy": "Copy",
    "delete": "Delete",
    "reset": "Reset",
    "params": "Params",
    "paste_not_svg": "Paste text does not contain SVG information",
    "no_svg_file": "No SVG file selected",
    "browser_not_support_clipboard": "Browser not support clipboard",
    "copy_failed": "Copy failed",
    "copied": "Copied",
    "load_params_failed": "Load params failed",
    "introduction": {
        "whyChoose": "Why Choose Our SVG Compressor?",
        "totalFree_title": "Total Free:",
        "totalFree": "This tool is totally free, no registration required, and helps every designer and developer.",
        "noSizeLimit_title": "No Size Limit:",
        "noSizeLimit": "Supports any size of SVG files, no need to worry about upload or processing limits.",
        "safeAndSecure_title": "Safe and Secure:",
        "safeAndSecure": "All compression operations are completed in the local browser, and no user files are saved on the server, ensuring your privacy and data security.",
        "fastProcessing_title": "Fast Processing:",
        "fastProcessing": "Using efficient algorithms, SVG compression is completed instantly, without waiting.",
        "highQualityCompression_title": "High-Quality Compression:",
        "highQualityCompression": "Ensures a high compression ratio while preserving the quality of the SVG image to the greatest extent.",
        "flexibleConfiguration_title": "Flexible Configuration:",
        "flexibleConfiguration": "Provides a rich set of compression parameters to meet different scenarios and needs, and customize the compression effect as needed."
    },
    "get_started": "Get Started",
    "view_on_github": "View on GitHub",
    "how_to_use": "How to Use",
    "guide_steps": [
        "Add SVG files: Drag & drop, select files, or paste SVG code directly.",
        "Real-time optimization: Uploaded SVGs are optimized instantly. Fine-tune settings in the right-hand panel for immediate results.",
        "Preview & compare: See the optimized SVG, check the size reduction, and compression ratio.",
        "Get the result: Copy the optimized SVG code (raw, Base64, or URL-encoded) or download the file directly."
    ],
    "features": "Features"
}